clear;
clc;
%% 程序开始

x = 0:100:5000;                                                            %创建探测点位置
X = 0:1:5000;                                                              %将插值点存储在X中
y = [341.96,311.10,315.74,324.49,321.14,333.09,318.68,338.88,325.66...
    ,309.84,328.62,321.80,320.74,308.30,328.45,312.62,317.83,327.40...
    ,323.75,313.48,316.66,340.19,332.40,319.20,334.64,311.43,328.92...
    ,314.11,319.84,321.28,333.84,319.68,321.20,320.89,325.90,335.28...
    ,332.00,324.47,313.36,330.60,322.32,315.10,319.89,316.75,321.92...
    ,327.64,320.40,329.88,332.00,344.35,348.41];                           %深度数据
n = length(x);                                                             %数据点个数
Y = spline (x,y,X);                                                        %使用matlab所带的三次样条插值函数spline求插值点值
N = length(X);                                                             %求出插值点个数

%% 计算所需光缆长度
L = 0;

for i = 2:N
    L = L+sqrt((X(i)-X(i-1))^2+(Y(i)-Y(i-1))^2);                           %循环计算光缆长度（勾股定理）
end

disp('所需光缆长度为L=');                                                   %在命令窗口显示一行字
disp(L);                                                                   %在命令行窗口给出L答案
figure
plot(x,y,'*',X,Y,'.');
xlabel('分点位置','fontsize',15);
ylabel('测点深度/m','fontsize',15);
title('铺设光缆的插值曲线图','fontsize',15);
grid on;